{
  "main": {
    "name":"Erick Pena",
    "occupation":"Sotware Engineer",
    "description":"I am a highly motivated student with a strong Computer Science background. I am very passionate about programming and I am always looking for new technologies to learn. Seek to pursue new position with room for advancement alongside growing team",
    "image":"profilepic.jpeg",
    "bio":"Use this bio section as your way of describing yourself and saying what you do, what technologies you like to use or feel most comfortable with, describing your personality, or whatever else you feel like throwing in.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "erick1439@live.com",
    "phone": "(845)-461-9811",
    "address":{
      "street":"7101 Budapest Way",
      "city":"Orlando",
      "state":"FL",
      "zip": "32822"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"resume.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/erick-pena",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/erick1439",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"http://github.com/erick1439",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Some of my skill are:",
    "education":[
      {
        "school":"University of Central Florida",
        "degree":"Bachelor of Computer Science",
        "graduated":"August 2020",
        "description":"This is the school I am currently attending and where I have been able to solidify many of my skills. Some of my favorite courses I have taken are parallel computing, computer graphics, and artificial intelligence. Also, during my time here I have been part of the Dean’s List multiple occasions for maintaining a GPA above 3.8."
      },
      {
        "school":"Valencia College",
        "degree":"Associates of Science: Computer Science",
        "graduated":"May 2018",
        "description":"This is the first school I attended toward my degree and where I learned most of my programming fundamentals."
      }
    ],
    "work":[
      {
        "company":"XI Media Labs",
        "title":"Software Developer ",
        "years":"January 2020 - Present",
        "descriptions": ["I form part of a group of developers that is in charge to implement a cryptocurrency in a social media platform."
        ]
      },
      {
        "company":"Universal Studios Orlando",
        "title":"Attraction Operator",
        "years":"February 2017 - Present",
        "descriptions": ["Deliver top quality customer service in professional manner while managing multiple tasks.",
          "Ensure the proper use of safety practices and procedures while operating the attraction.",
          "Evaluate and communicate with co-workers to meet goals and accomplish tasks."
        ]
      }
    ],
    "skills":[
      {
        "name":"Java",
        "level":"90%"
      },
      {
        "name":"JavaScript",
        "level":"85%"
      },
      {
        "name":"C",
        "level":"75%"
      },
      {
        "name":"Mern Stack",
        "level":"70%"
      },
      {
        "name":"HTML & CSS",
        "level":"80%"
      },
      {
        "name":"Git",
        "level":"70%"
      },
      {
        "name":"Microsoft Office",
        "level":"100%"
      }
    ]
  },
  "portfolio":{
    "check": [
      {
        "title":"Contacts Manger",
        "description": "This is a friendly responsive website that allows you to store all of your contacts in an organize manner. This project was developed with MongoDB, Express.js, React.js, and Node.js.",
        "images": ["contactsManager1.png","contactsManager2.png"],
        "size": "470"
      },
      {
        "title":"Character Keep",
        "description": "This forms part of a group project where the application was responsible to generate, collect, and save data from tabletop games such as Warhammer. I was in charge to create the mobile component of the interactive application on Android with the use of Java.",
        "images": ["characterKeeper1.png","characterKeeper2.png"],
        "size": "470"
      },
      {
        "title":"3D Cell Model",
        "description": "Develop in JavaScript with the use of Three.js, HTML, CSS, and Vectary. This is an interactive 3d project that allows users to learn the anatomy of an animal cell.",
        "images": ["3dCell1.png","3dCell2.png"],
        "size": "470"
      },
      {
        "title":"Atlantic Trails Resort",
        "description": "Developed with the use of HTML, CSS, JavaScript, and jQuery. This is a friendly responsive website used as the main online tool to represent a vacation Resort.",
        "images": ["atlantic1.png","atlantic2.png"],
        "size": "470"
      },
      {
        "title":"PL/0 Compiler",
        "description": "Develop in C, this program takes PL/0 instructions then it reads them character by character detecting any syntax errors, then it will parse it, and output the result from many of the logistics operations that was able to perform.",
        "images": ["canadian-wanderlust.jpg","canadian-wanderlust.jpg"],
        "size": "470"
      },
      {
        "title":"React Native Login System",
        "description": "This is an example of a project that I decided to create to explore and learn more about the React Native. To authenticate users I am using Google's Firebase tools to get familiar with their authentication system.",
        "images": ["reactNativeLogin1.png","reactNativeLogin2.png","reactNativeLogin3.png"],
        "size": "200"
      }
    ]
  }
}
